#pragma GCC diagnostic push
#include <nk/transport.h>
#include <nk/types.h>
#ifndef ____UInt16__RAWTYPE__
#define ____UInt16__RAWTYPE__
nk_static_assert(sizeof(nk_uint16_t) == 2, bad_nk_uint16_t_size);
nk_static_assert(nk_alignof(nk_uint16_t) == 2, bad_nk_uint16_t_align);
#endif /* ____UInt16__RAWTYPE__ */

#ifndef ____UInt8__RAWTYPE__
#define ____UInt8__RAWTYPE__
nk_static_assert(sizeof(nk_uint8_t) == 1, bad_nk_uint8_t_size);
nk_static_assert(nk_alignof(nk_uint8_t) == 1, bad_nk_uint8_t_align);
#endif /* ____UInt8__RAWTYPE__ */

#ifndef ____UInt64__RAWTYPE__
#define ____UInt64__RAWTYPE__
nk_static_assert(sizeof(nk_uint64_t) == 8, bad_nk_uint64_t_size);
nk_static_assert(nk_alignof(nk_uint64_t) == 8, bad_nk_uint64_t_align);
#endif /* ____UInt64__RAWTYPE__ */

#ifndef ____UInt32__RAWTYPE__
#define ____UInt32__RAWTYPE__
nk_static_assert(sizeof(nk_uint32_t) == 4, bad_nk_uint32_t_size);
nk_static_assert(nk_alignof(nk_uint32_t) == 4, bad_nk_uint32_t_align);
#endif /* ____UInt32__RAWTYPE__ */

#ifndef __kl_KlogStorage__Entry__STRUCT__
#define __kl_KlogStorage__Entry__STRUCT__
typedef struct __nk_packed kl_KlogStorage_Entry {
            __nk_alignas(8) nk_uint64_t id;
            __nk_alignas(8) nk_uint64_t timestamp;
            __nk_alignas(4) nk_uint32_t source;
            __nk_alignas(4) nk_uint32_t reason;
            __nk_alignas(1) nk_uint8_t msg[4096];
        } kl_KlogStorage_Entry;
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, id) == 0, bad_kl_KlogStorage_Entry_id_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, timestamp) == 8, bad_kl_KlogStorage_Entry_timestamp_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, source) == 16, bad_kl_KlogStorage_Entry_source_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, reason) == 20, bad_kl_KlogStorage_Entry_reason_offset);
nk_static_assert(nk_offsetof(kl_KlogStorage_Entry, msg) == 24, bad_kl_KlogStorage_Entry_msg_offset);
nk_static_assert(sizeof(struct kl_KlogStorage_Entry) == 4120, bad_kl_KlogStorage_Entry_size);
#ifdef NK_USE_UNQUALIFIED_NAMES
#define KlogStorage_Entry kl_KlogStorage_Entry
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_KlogStorage__Entry__STRUCT__ */

#ifndef __kl__KlogStorage__INTERFACE__
#define __kl__KlogStorage__INTERFACE__
enum {
    kl_KlogStorage_write_mid,
    kl_KlogStorage_read_mid,
    kl_KlogStorage_readRange_mid,
    kl_KlogStorage_mid_max,
};
enum {
    kl_KlogStorage_write_req_entry_size = 32,
    kl_KlogStorage_write_req_entry_elem_msg_size =
    4096,
    kl_KlogStorage_write_req_arena_size = 131840,
    kl_KlogStorage_write_res_arena_size = 0,
    kl_KlogStorage_write_req_handles = 0,
    kl_KlogStorage_write_res_handles = 0,
    kl_KlogStorage_write_err_handles = 0,
    kl_KlogStorage_read_res_entries_size = 32,
    kl_KlogStorage_read_res_entries_elem_msg_size =
    4096,
    kl_KlogStorage_read_req_arena_size = 0,
    kl_KlogStorage_read_res_arena_size = 131840,
